      ******************************************************************
      * Author: MARILENE COSTA
      * Date: 04/05/2021
      * Purpose: FREQUENCIA FIBONACCI
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LAYOUT-ARQUIVO.
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      ******************************************************************
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

      ******************************************************************
       PROCEDURE DIVISION.

            STOP RUN.
       END PROGRAM LAYOUT-ARQUIVO.
